{
  "version":"0.1.0-2022-07ESIPDemo",
  "title":"User interface code for the Data Management Training Clearinghouse",
  "description":"This is the collection of VUE 3 code developed in support of the <a href='https://www.dmtc-prod.org/home'>user interface</a> for the enhanced Data Management Training Clearinghouse from 2018-2022. This user interface is designed as a single-page web application and is dependent upon the server-side <a href='https://www.dmtc-prod.org/api'>application programming interface (API)</a> developed in parallel with the user interface. Development of the user interface and underlying service platform has been supported by the Institute of Museum and Library Services (https://ror.org/030prv062, Award Number LG-70-18-0092-18), the Science Gateways Community Institute, and the Earth Science Information Partners (https://ror.org/03q5xa910).",
  "keywords":[
    "Data Management Training",
    "Software",
    "User Interface",
    "Vue 3",
    "Clearinghouse"
  ],
  "creators":[
    {
      "name":"Benedict, Karl",
      "affiliation":"University of New Mexico",
      "orcid":"0000-0002-9109-2072"
    },
    {
      "name":"Wong, Mona",
      "affiliation":"San Diego Supercomputer Center"
    },
    {
      "name":"Hoebelheinrich, Nancy",
      "affiliation":"Knowledge Motifs, LLC",
      "orcid":"0000-0002-6797-7903"
    },
    {
      "name":"Barrett, Hays",
      "affiliation":"University of New Mexico"
    }
  ],
  "upload_type":"software",
  "access_right":"open",
  "license":"Apache-2.0",
  "notes":"<p>Required components to build and test the web application on a local development system include:</p> <ul>     <li>Docker - to run a local Apache container that can serve the devel, testing, or master (production) branches of the repository</li>     <li>Node.js - to provide the local toolchain for developing and building the app using NPM and the Vue CLI</li>     <li>NPM (typically installed with Node.js) - for installing the module dependencies and building the production app code</li>     <li>Vue CLI - for bootstrapping the development of a new Vue app if needed</li> </ul> <p>The module dependencies for the application are not included in the repository due to size requirements and should be installed in the local build/development environment by changing into the ui directory, and executing the npm install command.</p>  <p>For interactive development and previewing of updates, the npm run serve command can be run from the ui directory. Saved changes to the application source code will be reflected in the locally running instance of the application interface at localhost:8080 in a web browser.</p>  <p>Following successful installation of the application dependencies the production code for the application can be generated by changing into the ui directory and executing the npm run build command.</p>  <p>The three provided shell scripts:</p>  <p><code>rebuild-restart-devel.sh</code>, <code>rebuild-restart-testing.sh</code>, and <code>rebuild-restart-production.sh</code> automate the process of checking out the appropriate repository branch, stopping (if running) the corresponding apache web server (devel, testing, or production), removing and rebuilding the corresponding Docker image, and restarting the corresponding Docker container. When these commands are executed the running containers and associated user interface can be accessed at:</p> <ul>     <li>devel - localhost:8082</li>     <li>testing - localhost:8081</li>     <li>production - localhost:80</li> </ul>",
  "contributors":[
    {
      "name":"Earth Science Information Partners",
      "type":"Sponsor"
    },
    {
      "name":"Earth Science Information Partners",
      "type":"HostingInstitution"
    },
    {
      "name":"Institute of Museum and Library Services (IMLS)",
      "type":"Sponsor"
    },
    {
      "name":"Science Gateway Community Institute",
      "type":"Sponsor"
    }
   ]
}
